AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt102x/cpu/include/driver/flexspi/imx1020_flexspi_regs.h
/* Doze mode enable bit */
#define __FLEXSPI_MCR0_DOZEEN_SHIFT                 12
#define __FLEXSPI_MCR0_DOZEEN(x)                   (((x) & 0x01) << __FLEXSPI_MCR0_DOZEEN_SHIFT)

/* This bit is to support Flash Octal mode access by combining Port A and B Data pins */
#define __FLEXSPI_MCR0_COMBINATIONEN_SHIFT          13
#define __FLEXSPI_MCR0_COMBINATIONEN(x)            (((x) & 0x01) << __FLEXSPI_MCR0_COMBINATIONEN_SHIFT)

/* This bit is used to force SCK output free-running */
#define __FLEXSPI_MCR0_SCKFREERUNEN_SHIFT           14
#define __FLEXSPI_MCR0_SCKFREERUNEN(x)             (((x) & 0x01) << __FLEXSPI_MCR0_SCKFREERUNEN_SHIFT)

/* Time out wait cycle for IP command grant */
#define __FLEXSPI_MCR0_IPGRANTWAIT_SHIFT            16
#define __FLEXSPI_MCR0_IPGRANTWAIT(x)              (((x) & 0xFF) << __FLEXSPI_MCR0_IPGRANTWAIT_SHIFT)

/* Timeout wait cycle for AHB command grant */
#define __FLEXSPI_MCR0_AHBGRANTWAIT_SHIFT           24
#define __FLEXSPI_MCR0_AHBGRANTWAIT(x)             (((x) & 0xFF) << __FLEXSPI_MCR0_AHBGRANTWAIT_SHIFT)


/*******************************************************************************
  Module Control Register 1
*******************************************************************************/

/* AHB Read/Write access to Serial Flash Memory space timeout set */
#define __FLEXSPI_MCR1_AHBBUSWAIT_SHIFT             0
#define __FLEXSPI_MCR1_AHBBUSWAIT(x)               (((x) & 0xFFFF) << __FLEXSPI_MCR1_AHBBUSWAIT_SHIFT)

/* Command Sequence Execution timeout set */
#define __FLEXSPI_MCR1_SEQWAIT_SHIFT                16
#define __FLEXSPI_MCR1_SEQWAIT(x)                  (((x) & 0xFFFF) << __FLEXSPI_MCR1_SEQWAIT_SHIFT)

/*******************************************************************************
  Module Control Register 2
*******************************************************************************/


/* This bit determines whether AHB RX Buffer and AHB TX Buffer will be cleaned automaticaly when
 *  FlexSPI returns STOP mode ACK
 */
#define __FLEXSPI_MCR2_CLRAHBBUFOPT_SHIFT           11
#define __FLEXSPI_MCR2_CLRAHBBUFOPT(x)             (((x) & 0x1) << __FLEXSPI_MCR2_CLRAHBBUFOPT_SHIFT)

/* The sampling clock phase selection will be reset to phase 0 when this bit is written with 0x1 */
#define __FLEXSPI_MCR2_CLRLEARNPHASE_SHIFT          14
#define __FLEXSPI_MCR2_CLRLEARNPHASE(x)            (((x) & 0x1) << __FLEXSPI_MCR2_CLRLEARNPHASE_SHIFT)

/* All external devices are same devices (both in types and size) for A1/A2/B1/B2 */
#define __FLEXSPI_MCR2_SAMEDEVICEEN_SHIFT           15
#define __FLEXSPI_MCR2_SAMEDEVICEEN(x)             (((x) & 0x1) << __FLEXSPI_MCR2_SAMEDEVICEEN_SHIFT)

/* SCKB pad can be used as SCKA differential clock output (inverted clock to SCKA) */
#define __FLEXSPI_MCR2_SCKBDIFFOPT_SHIFT            19
#define __FLEXSPI_MCR2_SCKBDIFFOPT(x)              (((x) & 0x1) << __FLEXSPI_MCR2_SCKBDIFFOPT_SHIFT)

/* Wait cycle (in AHB clock cycle) for idle state before suspended command sequence resumed */
#define __FLEXSPI_MCR2_RESUMEWAIT_SHIFT             24
#define __FLEXSPI_MCR2_RESUMEWAIT(x)               (((x) & 0xff) << __FLEXSPI_MCR2_RESUMEWAIT_SHIFT)

#define __SCKB_USED_AS_B_SCK                        0
#define __SCKB_USED_AS_A_SCK                        1


/*******************************************************************************
  AHB Bus Control Register
*******************************************************************************/

/* Flash will be accessed in Individual mode */
#define __FLASH_INDIVIDUAL_MODE                     0

/* Flash will be accessed in Parallel mode */
#define __FLASH_PARALLEL_MODE                       1

/* Parallel mode enabled for AHB triggered Command (both read and write) */
#define __FLEXSPI_AHBCR_APAREN_SHIFT                0
#define __FLEXSPI_AHBCR_APAREN(x)                  (((x) & 0x1) << __FLEXSPI_AHBCR_APAREN_SHIFT)

/* Enable AHB bus cachable read access support */
#define __FLEXSPI_AHBCR_CACHABLEEN_SHIFT            3
#define __FLEXSPI_AHBCR_CACHABLEEN(x)              (((x) & 0x1) << __FLEXSPI_AHBCR_CACHABLEEN_SHIFT)

/* Enable AHB bus bufferable write access support */
#define __FLEXSPI_AHBCR_BUFFERABLEEN_SHIFT          4
#define __FLEXSPI_AHBCR_BUFFERABLEEN(x)            (((x) & 0x1) << __FLEXSPI_AHBCR_BUFFERABLEEN_SHIFT)

/* AHB Read Prefetch Enable */
#define __FLEXSPI_AHBCR_PREFETCHEN_SHIFT            5
#define __FLEXSPI_AHBCR_PREFETCHEN(x)              (((x) & 0x1) << __FLEXSPI_AHBCR_PREFETCHEN_SHIFT)

/*
 * AHB Read Address option bit. This option bit is intend to remove AHB burst
 * start address alignment limitation
 */
#define __FLEXSPI_AHBCR_READADDROPT_SHIFT           6
#define __FLEXSPI_AHBCR_READADDROPT(x)             (((x) & 0x1) << __FLEXSPI_AHBCR_READADDROPT_SHIFT)


/*******************************************************************************
  AHB RX Buffer 0 Control Register 0
*******************************************************************************/

/* AHB RX Buffer Size in 64 bits.Refer AHB RX Buffer Management for more details */
#define __FLEXSPI_AHBRXBUFCR0_BUFSZ_SHIFT           0
#define __FLEXSPI_AHBRXBUFCR0_BUFSZ(x)             (((x) & 0xFF) << __FLEXSPI_AHBRXBUFCR0_BUFSZ_SHIFT)

/* This AHB RX Buffer is assigned according to AHB Master with ID (MSTR_ID) */
#define __FLEXSPI_AHBRXBUFCR0_MSTRID_SHIFT          16
#define __FLEXSPI_AHBRXBUFCR0_MSTRID(x)            (((x) & 0xF) << __FLEXSPI_AHBRXBUFCR0_MSTRID_SHIFT)

/* This priority for AHB Master Read which this AHB RX Buffer is assigned */
#define __FLEXSPI_AHBRXBUFCR0_PRIORITY_SHIFT        24
#define __FLEXSPI_AHBRXBUFCR0_PRIORITY(x)          (((x) & 0x3) << __FLEXSPI_AHBRXBUFCR0_PRIORITY_SHIFT)

/*******************************************************************************
  Flash a Control Register 1
*******************************************************************************/

/* Serial Flash CS setup time */
#define __FLEXSPI_FLSHCR1_TCSS_SHIFT                0
#define __FLEXSPI_FLSHCR1_TCSS(x)                  (((x) & 0x1F) << __FLEXSPI_FLSHCR1_TCSS_SHIFT)

